/*************************************************************************
	> File Name: test04.c
	> Author:Sjs
    >定义一个数组指针,保存二维数组行地址
	> Mail:303547334@qq.com 
	> Created Time: 2020年07月02日 星期四 15时06分53秒
 ************************************************************************/

#include<stdio.h>
int main()
{
    int arr[3][4] = 
    {
        {1,2,3,4},
        {5,6,7,8},
        {9,10,11,12}
        
    };
    int (*p)[4] = arr;


    for(int i = 0; i<3; i++)
    {
        for(int j = 0; j < 4; j++)
        {
            printf("%d ", *(*(p+i)+j));
     //       printf("%d " ,arr[i][j]);
        }
        printf("\n");
    }
   return 0;
}
